Revit 2027 API
PropertyLine.IsClosedLoop Method
 Indicates whether the PropertyLine curves form a closed loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsClosedLoop()
Public Function IsClosedLoop As Boolean
public:
bool IsClosedLoop()
member IsClosedLoop : unit -> bool
Return Value
Boolean
 True if the curves are a closed loop; false otherwise.
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace